In [16]:
import numpy as np
import pandas as pd

# OPERATION IN PANDAS

In [17]:
df1 = pd.DataFrame({
    'A':[1, 2, 3, 4, 5],
    'B':[10, 20, 30, 40, 50],
    'C':[100, 200, 300, 400, 500]
})

In [18]:
df1

   A   B    C
0  1  10  100
1  2  20  200
2  3  30  300
3  4  40  400
4  5  50  500

In [19]:
df1.shape # the shape of the dataframe (rows, columns)

(5, 3)

In [20]:
df1.columns # list of columns in the dataframe

Index(['A', 'B', 'C'], dtype='object')

In [21]:
df1.info() # summary of the dataframe

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       5 non-null      int64
 1   B       5 non-null      int64
 2   C       5 non-null      int64
dtypes: int64(3)
memory usage: 252.0 bytes

In [22]:
df1.describe() # statistical summary of numerical columns

              A          B           C
count  5.000000   5.000000    5.000000
mean   3.000000  30.000000  300.000000
std    1.581139  15.811388  158.113883
min    1.000000  10.000000  100.000000
25%    2.000000  20.000000  200.000000
50%    3.000000  30.000000  300.000000
75%    4.000000  40.000000  400.000000
max    5.000000  50.000000  500.000000

In [23]:
df1['A'] + 10 # adding 10 to each element in column 'A'

0    11
1    12
2    13
3    14
4    15
Name: A, dtype: int64

In [24]:
def square(x):
    return x ** 2

In [25]:
df1['B'].apply(square) # applying the square function to each element in column 'B'
df1

   A   B    C
0  1  10  100
1  2  20  200
2  3  30  300
3  4  40  400
4  5  50  500

In [26]:
df1['B'] = df1['B'].apply(square) # updating column 'B' with squared values
df1

   A     B    C
0  1   100  100
1  2   400  200
2  3   900  300
3  4  1600  400
4  5  2500  500

In [27]:
df1['D'] = df1['A'] + df1['B'] # creating a new column 'D' as the sum of columns 'A' and 'B'
df1

   A     B    C     D
0  1   100  100   101
1  2   400  200   402
2  3   900  300   903
3  4  1600  400  1604
4  5  2500  500  2505

In [30]:
df1['E'] = df1['B'].apply(square) + 5 # creating a new column 'E' by applying the square function to column 'B' and adding 5
df1

   A     B    C     D        E
0  1   100  100   101    10005
1  2   400  200   402   160005
2  3   900  300   903   810005
3  4  1600  400  1604  2560005
4  5  2500  500  2505  6250005

In [32]:
df1['D'] = df1['B'].apply(lambda x: x + 5) # using a lambda function to add 5 to each element in column 'B' and store it in column 'D'
df1

   A     B    C     D        E
0  1   100  100   105    10005
1  2   400  200   405   160005
2  3   900  300   905   810005
3  4  1600  400  1605  2560005
4  5  2500  500  2505  6250005